In [1]:
import pandas as pd

###### Q1. How do you load a CSV file into a Pandas DataFrame?

In [5]:
df=pd.read_csv("weather_data.csv")
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

###### Q2. How do you check the data type of a column in a Pandas DataFrame?

In [6]:
df.dtypes

day             object
temperature    float64
windspeed      float64
event           object
dtype: object

###### Q3. How do you select rows from a Pandas DataFrame based on a condition?

In [7]:
df[df['event']=='Sunny']

         day  temperature  windspeed  event
1   1/4/2017          NaN        9.0  Sunny
5   1/8/2017          NaN        NaN  Sunny
8  1/11/2017         40.0       12.0  Sunny

In [8]:
df.loc[df['event']=='Sunny',]

         day  temperature  windspeed  event
1   1/4/2017          NaN        9.0  Sunny
5   1/8/2017          NaN        NaN  Sunny
8  1/11/2017         40.0       12.0  Sunny

###### Q4. How do you rename columns in a Pandas DataFrame?

In [11]:
df.rename(columns={"day":"date"},inplace=True)
df

        date  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

###### Q5. How do you drop columns in a Pandas DataFrame?

In [ ]:
df.drop(columns=['windspeed'],inplace=True)

In [14]:
df

        date  temperature   event
0   1/1/2017         32.0    Rain
1   1/4/2017          NaN   Sunny
2   1/5/2017         28.0    Snow
3   1/6/2017          NaN     NaN
4   1/7/2017         32.0    Rain
5   1/8/2017          NaN   Sunny
6   1/9/2017          NaN     NaN
7  1/10/2017         34.0  Cloudy
8  1/11/2017         40.0   Sunny

###### Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [15]:
df['event'].unique()

array(['Rain', 'Sunny', 'Snow', nan, 'Cloudy'], dtype=object)

###### Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [77]:
df.isna().sum()

date               0
temperature        4
event              2
new_temperature    4
dtype: int64

###### Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [81]:
df.fillna(value={'temperature':'30','event':'Winter'})

        date temperature   event  new_temperature
0   1/1/2017          32    Rain             37.0
1   1/4/2017          30   Sunny              NaN
2   1/5/2017          28    Snow             33.0
3   1/6/2017          30  Winter              NaN
4   1/7/2017          32    Rain             37.0
5   1/8/2017          30   Sunny              NaN
6   1/9/2017          30  Winter              NaN
7  1/10/2017          34  Cloudy             39.0
8  1/11/2017          40   Sunny             45.0

###### Q9. How do you concatenate two Pandas DataFrames?

In [23]:
df
#creating dummy dataframe to perform concatenation

df_2 = pd.DataFrame({
    'date':['1/10/2023'],
    'temperature':[10],
    'event':['Winter'],
       
})

#concatenating two dataframes
pd.concat([df,df_2],ignore_index=True)

        date  temperature   event
0   1/1/2017         32.0    Rain
1   1/4/2017          NaN   Sunny
2   1/5/2017         28.0    Snow
3   1/6/2017          NaN     NaN
4   1/7/2017         32.0    Rain
5   1/8/2017          NaN   Sunny
6   1/9/2017          NaN     NaN
7  1/10/2017         34.0  Cloudy
8  1/11/2017         40.0   Sunny
9  1/10/2023         10.0  Winter

###### Q10. How do you merge two Pandas DataFrames on a specific column?

In [25]:
#Using Merge Function
pd.merge(df,df_2,on=['date'],how='right')

        date  temperature_x event_x  temperature_y event_y
0  1/10/2023            NaN     NaN             10  Winter

###### Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [26]:
df.groupby('event').aggregate({'temperature':'max'})

        temperature
event
Cloudy         34.0
Rain           32.0
Snow           28.0
Sunny          40.0

###### Q12. How do you pivot a Pandas DataFrame?

In [28]:
df.pivot(index='date',columns='event',values='temperature')

event      NaN  Cloudy  Rain  Snow  Sunny
date
1/1/2017   NaN     NaN  32.0   NaN    NaN
1/10/2017  NaN    34.0   NaN   NaN    NaN
1/11/2017  NaN     NaN   NaN   NaN   40.0
1/4/2017   NaN     NaN   NaN   NaN    NaN
1/5/2017   NaN     NaN   NaN  28.0    NaN
1/6/2017   NaN     NaN   NaN   NaN    NaN
1/7/2017   NaN     NaN  32.0   NaN    NaN
1/8/2017   NaN     NaN   NaN   NaN    NaN
1/9/2017   NaN     NaN   NaN   NaN    NaN

###### Q13. How do you change the data type of a column in a Pandas DataFrame?

In [82]:
df.dtypes

date                object
temperature        float64
event               object
new_temperature    float64
dtype: object

In [85]:
df['new_temperature']=df['new_temperature'].astype(str)

In [86]:
df.dtypes

date                object
temperature        float64
event               object
new_temperature     object
dtype: object

###### Q14. How do you sort a Pandas DataFrame by a specific column?

In [31]:
df.sort_values(by=['temperature'],ascending=True)

        date  temperature   event
2   1/5/2017         28.0    Snow
0   1/1/2017         32.0    Rain
4   1/7/2017         32.0    Rain
7  1/10/2017         34.0  Cloudy
8  1/11/2017         40.0   Sunny
1   1/4/2017          NaN   Sunny
3   1/6/2017          NaN     NaN
5   1/8/2017          NaN   Sunny
6   1/9/2017          NaN     NaN

###### Q15. How do you create a copy of a Pandas DataFrame?

In [87]:
df_copy=df.copy()
df_copy

        date  temperature   event new_temperature
0   1/1/2017         32.0    Rain            37.0
1   1/4/2017          NaN   Sunny             nan
2   1/5/2017         28.0    Snow            33.0
3   1/6/2017          NaN     NaN             nan
4   1/7/2017         32.0    Rain            37.0
5   1/8/2017          NaN   Sunny             nan
6   1/9/2017          NaN     NaN             nan
7  1/10/2017         34.0  Cloudy            39.0
8  1/11/2017         40.0   Sunny            45.0

###### Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [34]:
df.loc[(df['event']=="Sunny") & (~df['temperature'].isnull() )]

        date  temperature  event
8  1/11/2017         40.0  Sunny

###### Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [37]:
df['temperature'].mean()

33.2

###### Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

In [89]:
std_dev =df.std()
std_dev

temperature    4.38178
dtype: float64

###### Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [92]:
df['temperature'].corr(df['new_temperature'].astype('float'))

1.0

###### Q20. How do you select specific columns in a DataFrame using their labels?

In [39]:
df[["date"]]

        date
0   1/1/2017
1   1/4/2017
2   1/5/2017
3   1/6/2017
4   1/7/2017
5   1/8/2017
6   1/9/2017
7  1/10/2017
8  1/11/2017

###### Q21. How do you select specific rows in a DataFrame using their indexes?

In [57]:
#selecting rows having index between 2 and 5 both inclusive
df.loc[2:5,]

       date  temperature  event
2  1/5/2017         28.0   Snow
3  1/6/2017          NaN    NaN
4  1/7/2017         32.0   Rain
5  1/8/2017          NaN  Sunny

In [64]:
#selecting the rows having index 2 and 5. ONly two rows
df.iloc[[2,5]]

       date  temperature  event
2  1/5/2017         28.0   Snow
5  1/8/2017          NaN  Sunny

###### Q22. How do you sort a DataFrame by a specific column?

In [65]:
df.sort_values(by=['temperature'],ascending=True)

        date  temperature   event
2   1/5/2017         28.0    Snow
0   1/1/2017         32.0    Rain
4   1/7/2017         32.0    Rain
7  1/10/2017         34.0  Cloudy
8  1/11/2017         40.0   Sunny
1   1/4/2017          NaN   Sunny
3   1/6/2017          NaN     NaN
5   1/8/2017          NaN   Sunny
6   1/9/2017          NaN     NaN

###### Q23. How do you create a new column in a DataFrame based on the values of another column?

In [68]:
df['new_temperature']=df['temperature']+5
df

        date  temperature   event  new_temperature
0   1/1/2017         32.0    Rain             37.0
1   1/4/2017          NaN   Sunny              NaN
2   1/5/2017         28.0    Snow             33.0
3   1/6/2017          NaN     NaN              NaN
4   1/7/2017         32.0    Rain             37.0
5   1/8/2017          NaN   Sunny              NaN
6   1/9/2017          NaN     NaN              NaN
7  1/10/2017         34.0  Cloudy             39.0
8  1/11/2017         40.0   Sunny             45.0

###### Q24. How do you remove duplicates from a DataFrame?

In [71]:
df.drop_duplicates(subset=['event'])

        date  temperature   event  new_temperature
0   1/1/2017         32.0    Rain             37.0
1   1/4/2017          NaN   Sunny              NaN
2   1/5/2017         28.0    Snow             33.0
3   1/6/2017          NaN     NaN              NaN
7  1/10/2017         34.0  Cloudy             39.0

###### Q25. What is the difference between .loc and .iloc in Pandas?

 iloc : It is based on the integer potion of the columns and index
        Also while doing slicing of row and columns it acts as a exlusive for last slice position
        
loc: It is based on the label of the columns and index
     It is inclusive for slicing